tylertms/dspic33e-sim/conformance/usb.c
static void host_cases(UsbConformance* state, Dspic33* cpu) {
    Dspic33UsbPacket packet;
    uint8_t input[4] = {0x11u, 0x22u, 0x33u, 0x44u};
    uint8_t output[3] = {0xa1u, 0xb2u, 0xc3u};
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, PWRC, 1u);
    dspic33_write_word(cpu, BDTP1, 0x0060u);
    dspic33_write_word(cpu, CON, 0x0008u);
    dspic33_write_word(cpu, ADDR, 0x0085u);
    write_descriptor(cpu, 0u, 0u, 0u, 0x0088u, sizeof(input), BUFFER);
    dspic33_write_word(cpu, TOK, 0x0090u);
    expect(state,
           dspic33_usb_transmit(cpu, &packet) && packet.pid == DSPIC33_USB_PID_IN &&
               packet.address == 5u && packet.low_speed && packet.endpoint == 0u &&
               packet.size == 0u && (dspic33_read_word(cpu, CON) & 0x0020u) != 0u,
           "USB host IN token");
    expect(state,
           dspic33_usb_host_response(cpu, DSPIC33_USB_HANDSHAKE_ACK, input,
                                     sizeof(input), false, 1u) &&
               dspic33_device_advance(cpu, 1u),
           "USB host IN response schedule");
    expect(state,
           memcmp(cpu->data + BUFFER, input, sizeof(input)) == 0 &&
               (dspic33_read_word(cpu, CON) & 0x0020u) == 0u &&
               dspic33_read_word(cpu, STAT) == 0u,
           "USB host IN completion");
    clear_transaction(cpu);
    memcpy(cpu->data + BUFFER + 0x100u, output, sizeof(output));
    write_descriptor(cpu, 0u, 1u, 0u, 0x0088u, sizeof(output), BUFFER + 0x100u);
    dspic33_write_word(cpu, TOK, 0x0013u);
    expect(state,
           dspic33_usb_transmit(cpu, &packet) && packet.pid == DSPIC33_USB_PID_OUT &&
               packet.endpoint == 3u && packet_data(&packet, output, sizeof(output)),
           "USB host OUT token payload");
    expect(state,
           dspic33_usb_host_response(cpu, DSPIC33_USB_HANDSHAKE_ACK, NULL, 0u, false,
                                     0u) &&
               dspic33_device_advance(cpu, 0u),
           "USB host OUT response schedule");
    expect(state,
           memory_word(cpu, descriptor_address(0u, 1u, 0u)) == 0x0008u &&
               dspic33_read_word(cpu, STAT) == 8u,
           "USB host OUT completion");
    clear_transaction(cpu);
    write_descriptor(cpu, 0u, 0u, 1u, 0x0088u, 4u, BUFFER);
    dspic33_write_word(cpu, TOK, 0x0090u);
    expect(state,
           dspic33_usb_host_response(cpu, DSPIC33_USB_HANDSHAKE_TIMEOUT, NULL, 0u,
                                     false, 0u) &&
               dspic33_device_advance(cpu, 0u),
           "USB host timeout schedule");
    expect(state,
           (dspic33_read_word(cpu, EIR) & 0x0010u) != 0u &&
               cpu->io.usb_last_handshake == DSPIC33_USB_HANDSHAKE_TIMEOUT,
           "USB host timeout error");
    clear_transaction(cpu);
    write_descriptor(cpu, 0u, 0u, 0u, 0x0088u, 4u, BUFFER);
    dspic33_write_word(cpu, TOK, 0x0090u);
    expect(state,
           dspic33_usb_host_response(cpu, DSPIC33_USB_HANDSHAKE_NAK, NULL, 0u, false,
                                     0u) &&
               dspic33_device_advance(cpu, 0u),
           "USB host NAK schedule");
    expect(state, memory_word(cpu, descriptor_address(0u, 0u, 0u)) == 0x0028u,
           "USB host NAK status");
    clear_transaction(cpu);
    write_descriptor(cpu, 0u, 0u, 1u, 0x0088u, 4u, BUFFER);
    dspic33_write_word(cpu, TOK, 0x0090u);
    expect(state,
           dspic33_usb_host_response(cpu, DSPIC33_USB_HANDSHAKE_STALL, NULL, 0u, false,
                                     0u) &&
               dspic33_device_advance(cpu, 0u),
           "USB host STALL schedule");
    expect(state, memory_word(cpu, descriptor_address(0u, 0u, 1u)) == 0x0038u,
           "USB host STALL status");
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, PWRC, 1u);
    dspic33_write_word(cpu, CON, 9u);
    expect(state,
           dspic33_device_advance(cpu, 59999u) && dspic33_read_word(cpu, FRML) == 0u,
           "USB host SOF period boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_read_word(cpu, FRML) == 1u &&
               (dspic33_read_word(cpu, IR) & 4u) != 0u,
           "USB host first SOF");
    dspic33_write_word(cpu, IR, 4u);
    expect(state,
           dspic33_device_advance(cpu, 60000u) && dspic33_read_word(cpu, FRML) == 2u,
           "USB host recurring SOF");
}

static void copy_and_reset_cases(UsbConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    Dspic33UsbPacket first;
    Dspic33UsbPacket second;
    uint8_t data[3] = {7u, 8u, 9u};
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize USB copy");
    if (!initialized) {
        return;
    }
    configure_device(cpu);
    write_descriptor(cpu, 2u, 0u, 0u, 0x0088u, 3u, BUFFER);
    expect(state, dspic33_usb_receive(cpu, 2u, data, 3u, 2u),
           "USB copy pending schedule");
    expect(state, dspic33_copy(&copy, cpu), "copy pending USB state");
    expect(state, dspic33_device_advance(cpu, 2u) && dspic33_device_advance(&copy, 2u),
           "USB copy advance");
    expect(state,
           dspic33_usb_transmit(cpu, &first) && dspic33_usb_transmit(&copy, &second) &&
               first.handshake == second.handshake &&
               memcmp(cpu->data + BUFFER, copy.data + BUFFER, 3u) == 0,
           "USB copied state matches");
    dspic33_destroy(&copy);
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.usb_tx.count == 0u && cpu->io.usb_status_count == 0u &&
               dspic33_read_word(cpu, PWRC) == 0u && dspic33_read_word(cpu, CON) == 0u,
           "USB reset clears runtime");
}

int main(void) {
    UsbConformance state = {0u, 0u, 0u};
    Dspic33 cpu;
    if (!dspic33_initialize(&cpu)) {
        fprintf(stderr, "[usb-error] cannot initialize emulator\n");
        return 2;
    }
    register_cases(&state, &cpu);
    out_payload_domain(&state, &cpu);
    in_payload_domain(&state, &cpu);
    descriptor_behavior_cases(&state, &cpu);
    status_fifo_cases(&state, &cpu);
    boundary_and_order_cases(&state, &cpu);
    interrupt_and_bus_cases(&state, &cpu);
    host_cases(&state, &cpu);
    copy_and_reset_cases(&state, &cpu);
    printf("[usb-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    dspic33_destroy(&cpu);
    return state.failed == 0u ? 0 : 1;
}
